balazsgrill/modembed/res/Devices/dsPIC33/DSPIC33FJ128GP202.PIC
        <edc:SFRDef edc:access="nnnnnnnnnn-nnnnn" edc:cname="CLKDIV" edc:desc="" edc:impl="0xffdf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0011000001-00000" edc:name="CLKDIV" edc:nzwidth="0x10" edc:por="0011000001-00000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PLLPRE" edc:desc="" edc:mask="0x1f" edc:name="PLLPRE" edc:nzwidth="0x5"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="PLLPOST" edc:desc="" edc:mask="0x3" edc:name="PLLPOST" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="FRCDIV" edc:desc="" edc:mask="0x7" edc:name="FRCDIV" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="DOZEN" edc:desc="" edc:mask="0x1" edc:name="DOZEN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DOZE" edc:desc="" edc:mask="0x7" edc:name="DOZE" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="ROI" edc:desc="" edc:mask="0x1" edc:name="ROI" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="PLLPRE0" edc:desc="" edc:mask="0x1" edc:name="PLLPRE0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PLLPRE1" edc:desc="" edc:mask="0x1" edc:name="PLLPRE1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PLLPRE2" edc:desc="" edc:mask="0x1" edc:name="PLLPRE2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PLLPRE3" edc:desc="" edc:mask="0x1" edc:name="PLLPRE3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PLLPRE4" edc:desc="" edc:mask="0x1" edc:name="PLLPRE4" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="PLLPOST0" edc:desc="" edc:mask="0x1" edc:name="PLLPOST0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PLLPOST1" edc:desc="" edc:mask="0x1" edc:name="PLLPOST1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FRCDIV0" edc:desc="" edc:mask="0x1" edc:name="FRCDIV0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FRCDIV1" edc:desc="" edc:mask="0x1" edc:name="FRCDIV1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FRCDIV2" edc:desc="" edc:mask="0x1" edc:name="FRCDIV2" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="DOZE0" edc:desc="" edc:mask="0x1" edc:name="DOZE0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DOZE1" edc:desc="" edc:mask="0x1" edc:name="DOZE1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DOZE2" edc:desc="" edc:mask="0x1" edc:name="DOZE2" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-------nnnnnnnnn" edc:cname="PLLFBD" edc:desc="" edc:impl="0x1ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-------uuuuuuuuu" edc:name="PLLFBD" edc:nzwidth="0x10" edc:por="-------000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PLLDIV" edc:desc="" edc:mask="0x1ff" edc:name="PLLDIV" edc:nzwidth="0x9"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="PLLDIV0" edc:desc="" edc:mask="0x1" edc:name="PLLDIV0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PLLDIV1" edc:desc="" edc:mask="0x1" edc:name="PLLDIV1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PLLDIV2" edc:desc="" edc:mask="0x1" edc:name="PLLDIV2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PLLDIV3" edc:desc="" edc:mask="0x1" edc:name="PLLDIV3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PLLDIV4" edc:desc="" edc:mask="0x1" edc:name="PLLDIV4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PLLDIV5" edc:desc="" edc:mask="0x1" edc:name="PLLDIV5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PLLDIV6" edc:desc="" edc:mask="0x1" edc:name="PLLDIV6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PLLDIV7" edc:desc="" edc:mask="0x1" edc:name="PLLDIV7" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PLLDIV8" edc:desc="" edc:mask="0x1" edc:name="PLLDIV8" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="----------nnnnnn" edc:cname="OSCTUN" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------uuuuuu" edc:name="OSCTUN" edc:nzwidth="0x10" edc:por="----------000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TUN" edc:desc="" edc:mask="0x3f" edc:name="TUN" edc:nzwidth="0x6"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="TUN0" edc:desc="" edc:mask="0x1" edc:name="TUN0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TUN1" edc:desc="" edc:mask="0x1" edc:name="TUN1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TUN2" edc:desc="" edc:mask="0x1" edc:name="TUN2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TUN3" edc:desc="" edc:mask="0x1" edc:name="TUN3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TUN4" edc:desc="" edc:mask="0x1" edc:name="TUN4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TUN5" edc:desc="" edc:mask="0x1" edc:name="TUN5" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnnn-------" edc:cname="ACLKCON" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--xxxxxxx-------" edc:name="ACLKCON" edc:nzwidth="16" edc:por="--xxxxxxx-------">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="7"/>
              <edc:SFRFieldDef edc:cname="ASRCSEL" edc:desc="" edc:mask="0x1" edc:name="ASRCSEL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="APSTSCLR" edc:desc="" edc:mask="0x7" edc:name="APSTSCLR" edc:nzwidth="3"/>
              <edc:SFRFieldDef edc:cname="AOSCMD" edc:desc="" edc:mask="0x3" edc:name="AOSCMD" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="SELACLK" edc:desc="" edc:mask="0x1" edc:name="SELACLK" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="8"/>
              <edc:SFRFieldDef edc:cname="APSTSCLR0" edc:desc="" edc:mask="0x1" edc:name="APSTSCLR0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="APSTSCLR1" edc:desc="" edc:mask="0x1" edc:name="APSTSCLR1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="APSTSCLR2" edc:desc="" edc:mask="0x1" edc:name="APSTSCLR2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="AOSCMD0" edc:desc="" edc:mask="0x1" edc:name="AOSCMD0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="AOSCMD1" edc:desc="" edc:mask="0x1" edc:name="AOSCMD1" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="4"/>
        <edc:SFRDef edc:access="-------------nnn" edc:cname="BSRAM" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-------------uuu" edc:name="BSRAM" edc:nzwidth="16" edc:por="-------------000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RL_BSR" edc:desc="" edc:mask="0x1" edc:name="RL_BSR" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IR_BSR" edc:desc="" edc:mask="0x1" edc:name="IR_BSR" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IW_BSR" edc:desc="" edc:mask="0x1" edc:name="IW_BSR" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-------------nnn" edc:cname="SSRAM" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-------------uuu" edc:name="SSRAM" edc:nzwidth="16" edc:por="-------------000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RL_SSR" edc:desc="" edc:mask="0x1" edc:name="RL_SSR" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IR_SSR" edc:desc="" edc:mask="0x1" edc:name="IR_SSR" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IW_SSR" edc:desc="" edc:mask="0x1" edc:name="IW_SSR" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="12"/>
        <edc:SFRDef edc:access="snn------n--nnnn" edc:cname="NVMCON" edc:desc="" edc:impl="0xe04f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="000------0--0000" edc:name="NVMCON" edc:nzwidth="0x10" edc:por="000------0--0000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="NVMOP" edc:desc="" edc:mask="0xf" edc:name="NVMOP" edc:nzwidth="0x4"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="ERASE" edc:desc="" edc:mask="0x1" edc:name="ERASE" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="6"/>
              <edc:SFRFieldDef edc:cname="WRERR" edc:desc="" edc:mask="0x1" edc:name="WRERR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WREN" edc:desc="" edc:mask="0x1" edc:name="WREN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WR" edc:desc="" edc:mask="0x1" edc:name="WR" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="NVMOP0" edc:desc="" edc:mask="0x1" edc:name="NVMOP0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="NVMOP1" edc:desc="" edc:mask="0x1" edc:name="NVMOP1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="NVMOP2" edc:desc="" edc:mask="0x1" edc:name="NVMOP2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="NVMOP3" edc:desc="" edc:mask="0x1" edc:name="NVMOP3" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="r" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="4"/>
        <edc:SFRDef edc:access="--------wwwwwwww" edc:cname="NVMKEY" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------00000000" edc:name="NVMKEY" edc:nzwidth="0x10" edc:por="--------00000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="NVMKEY" edc:desc="" edc:islanghidden="true" edc:mask="0xff" edc:name="NVMKEY" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="r" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="8"/>
        <edc:SFRDef edc:access="nnnnn--nnnnnn--n" edc:cname="PMD1" edc:desc="" edc:impl="0xfffb" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000--000000--0" edc:name="PMD1" edc:nzwidth="0x10" edc:por="00000--000000--0">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="AD1MD" edc:desc="" edc:mask="0x1" edc:name="AD1MD" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="SPI1MD" edc:desc="" edc:mask="0x1" edc:name="SPI1MD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SPI2MD" edc:desc="" edc:mask="0x1" edc:name="SPI2MD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U1MD" edc:desc="" edc:mask="0x1" edc:name="U1MD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U2MD" edc:desc="" edc:mask="0x1" edc:name="U2MD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="I2C1MD" edc:desc="" edc:mask="0x1" edc:name="I2CMD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DCIMD" edc:desc="" edc:mask="0x1" edc:name="DCIMD" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="T1MD" edc:desc="" edc:mask="0x1" edc:name="T1MD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T2MD" edc:desc="" edc:mask="0x1" edc:name="T2MD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T3MD" edc:desc="" edc:mask="0x1" edc:name="T3MD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T4MD" edc:desc="" edc:mask="0x1" edc:name="T4MD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T5MD" edc:desc="" edc:mask="0x1" edc:name="T5MD" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rw" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nn----nn----nnnn" edc:cname="PMD2" edc:desc="" edc:impl="0xc30f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00----00----0000" edc:name="PMD2" edc:nzwidth="0x10" edc:por="00----00----0000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="OC1MD" edc:desc="" edc:mask="0x1" edc:name="0C1MD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OC2MD" edc:desc="" edc:mask="0x1" edc:name="OC2MD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OC3MD" edc:desc="" edc:mask="0x1" edc:name="OC3MD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OC4MD" edc:desc="" edc:mask="0x1" edc:name="OC4MD" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="IC1MD" edc:desc="" edc:mask="0x1" edc:name="IC1MD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IC2MD" edc:desc="" edc:mask="0x1" edc:name="IC2MD" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="IC7MD" edc:desc="" edc:mask="0x1" edc:name="IC7MD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IC8MD" edc:desc="" edc:mask="0x1" edc:name="IC8MD" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rw" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-----nnnn-------" edc:cname="PMD3" edc:desc="" edc:impl="0x702" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----0000-------" edc:name="PMD3" edc:nzwidth="0x10" edc:por="-----0000-------">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="4"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="CRCMD" edc:desc="" edc:mask="0x1" edc:name="CRCMD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PMPMD" edc:desc="" edc:mask="0x1" edc:name="PMPMD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RTCCMD" edc:desc="" edc:mask="0x1" edc:name="RTCCMD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CMPMD" edc:desc="" edc:mask="0x1" edc:name="CMPMD" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rw" edc:stimtype="Record"/>
        </edc:SFRDef>
      </edc:SFRDataSector>
      <edc:EmulatorSector edc:beginaddr="0xFD0000" edc:endaddr="0xfd003e" edc:regionid="emulreg"/>
      <edc:GPRDataSector edc:beginaddr="0x800" edc:endaddr="0x2000" edc:regionid="data"/>
      <edc:DPRDataSector edc:beginaddr="0x2000" edc:endaddr="0x2800" edc:regionid="dma"/>
    </edc:RegardlessOfMode>
    <edc:TraditionalModeOnly/>
    <edc:ExtendedModeOnly/>
  </edc:DataSpace>
  <edc:PinList>
    <edc:Pin>
      <!--Pin 1-->
      <edc:VirtualPin edc:name="MCLR"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 2-->
      <edc:VirtualPin edc:name="AN0"/>
      <edc:VirtualPin edc:name="VREF+"/>
      <edc:VirtualPin edc:name="CN2"/>
      <edc:VirtualPin edc:name="RA0"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 3-->
      <edc:VirtualPin edc:name="AN1"/>
      <edc:VirtualPin edc:name="VREF-"/>
      <edc:VirtualPin edc:name="CN3"/>
      <edc:VirtualPin edc:name="RA1"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 4-->
      <edc:VirtualPin edc:name="PGED1"/>
      <edc:VirtualPin edc:name="AN2"/>
      <edc:VirtualPin edc:name="C2IN-"/>
      <edc:VirtualPin edc:name="RP0"/>
      <edc:VirtualPin edc:name="CN4"/>
      <edc:VirtualPin edc:name="RB0"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 5-->
      <edc:VirtualPin edc:name="PGEC1"/>
      <edc:VirtualPin edc:name="AN3"/>
      <edc:VirtualPin edc:name="C2IN+"/>
      <edc:VirtualPin edc:name="RP1"/>
      <edc:VirtualPin edc:name="CN5"/>
      <edc:VirtualPin edc:name="RB1"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 6-->
      <edc:VirtualPin edc:name="AN4"/>
      <edc:VirtualPin edc:name="C1IN-"/>
      <edc:VirtualPin edc:name="RP2"/>
      <edc:VirtualPin edc:name="CN6"/>
      <edc:VirtualPin edc:name="RB2"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 7-->
      <edc:VirtualPin edc:name="AN5"/>
      <edc:VirtualPin edc:name="C1IN+"/>
      <edc:VirtualPin edc:name="RP3"/>
      <edc:VirtualPin edc:name="CN7"/>
      <edc:VirtualPin edc:name="RB3"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 8-->
      <edc:VirtualPin edc:name="VSS"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 9-->
      <edc:VirtualPin edc:name="OSC1"/>
      <edc:VirtualPin edc:name="CLKI"/>
      <edc:VirtualPin edc:name="CN30"/>
      <edc:VirtualPin edc:name="RA2"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 10-->
      <edc:VirtualPin edc:name="OSC2"/>
      <edc:VirtualPin edc:name="CLKO"/>
      <edc:VirtualPin edc:name="CN29"/>
      <edc:VirtualPin edc:name="PMA0"/>
      <edc:VirtualPin edc:name="RA3"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 11-->
      <edc:VirtualPin edc:name="SOSCI"/>
      <edc:VirtualPin edc:name="RP4"/>
      <edc:VirtualPin edc:name="CN1"/>
      <edc:VirtualPin edc:name="PMBE"/>
      <edc:VirtualPin edc:name="RB4"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 12-->
      <edc:VirtualPin edc:name="SOSCO"/>
      <edc:VirtualPin edc:name="T1CK"/>
      <edc:VirtualPin edc:name="CN0"/>
      <edc:VirtualPin edc:name="PMA1"/>
      <edc:VirtualPin edc:name="RA4"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 13-->
      <edc:VirtualPin edc:name="VDD"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 14-->
      <edc:VirtualPin edc:name="PGED3"/>
      <edc:VirtualPin edc:name="ASDA1"/>
      <edc:VirtualPin edc:name="RP5"/>
      <edc:VirtualPin edc:name="CN27"/>
      <edc:VirtualPin edc:name="PMD7"/>
      <edc:VirtualPin edc:name="RB5"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 15-->
      <edc:VirtualPin edc:name="PGEC3"/>
      <edc:VirtualPin edc:name="ASCL1"/>
      <edc:VirtualPin edc:name="RP6"/>
      <edc:VirtualPin edc:name="CN24"/>
      <edc:VirtualPin edc:name="PMD6"/>
      <edc:VirtualPin edc:name="RB6"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 16-->
      <edc:VirtualPin edc:name="NT0"/>
      <edc:VirtualPin edc:name="RP7"/>
      <edc:VirtualPin edc:name="CN23"/>
      <edc:VirtualPin edc:name="PMD5"/>
      <edc:VirtualPin edc:name="RB7"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 17-->
      <edc:VirtualPin edc:name="TCK"/>
      <edc:VirtualPin edc:name="SCL1"/>
      <edc:VirtualPin edc:name="RP8"/>
      <edc:VirtualPin edc:name="CN22"/>
      <edc:VirtualPin edc:name="PMD4"/>
      <edc:VirtualPin edc:name="RB8"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 18-->
      <edc:VirtualPin edc:name="TDO"/>
      <edc:VirtualPin edc:name="SDA1"/>
      <edc:VirtualPin edc:name="RP9"/>
      <edc:VirtualPin edc:name="CN21"/>
      <edc:VirtualPin edc:name="PMD3"/>
      <edc:VirtualPin edc:name="RB9"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 19-->
      <edc:VirtualPin edc:name="VSS"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 20-->
      <edc:VirtualPin edc:name="VCAP"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 21-->
      <edc:VirtualPin edc:name="PGED2"/>
      <edc:VirtualPin edc:name="TDI"/>
      <edc:VirtualPin edc:name="RP10"/>
      <edc:VirtualPin edc:name="CN16"/>
      <edc:VirtualPin edc:name="PMD2"/>
      <edc:VirtualPin edc:name="RB10"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 22-->
      <edc:VirtualPin edc:name="PGEC2"/>
      <edc:VirtualPin edc:name="TMS"/>
      <edc:VirtualPin edc:name="RP11"/>
      <edc:VirtualPin edc:name="CN15"/>
      <edc:VirtualPin edc:name="PMD1"/>
      <edc:VirtualPin edc:name="RB11"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 23-->
      <edc:VirtualPin edc:name="AN12"/>
      <edc:VirtualPin edc:name="RP12"/>
      <edc:VirtualPin edc:name="CN14"/>
      <edc:VirtualPin edc:name="PMD0"/>
      <edc:VirtualPin edc:name="RB12"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 24-->
      <edc:VirtualPin edc:name="AN11"/>
      <edc:VirtualPin edc:name="RP13"/>
      <edc:VirtualPin edc:name="CN13"/>
      <edc:VirtualPin edc:name="PMRD"/>
      <edc:VirtualPin edc:name="RB13"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 25-->
      <edc:VirtualPin edc:name="AN10"/>
      <edc:VirtualPin edc:name="RTCC"/>
      <edc:VirtualPin edc:name="RP14"/>
      <edc:VirtualPin edc:name="CN12"/>
      <edc:VirtualPin edc:name="PMWR"/>
      <edc:VirtualPin edc:name="RB14"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 26-->
      <edc:VirtualPin edc:name="AN9"/>
      <edc:VirtualPin edc:name="RP15"/>
      <edc:VirtualPin edc:name="CN11"/>
      <edc:VirtualPin edc:name="PMCS1"/>
      <edc:VirtualPin edc:name="RB15"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 27-->
      <edc:VirtualPin edc:name="AVSS"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 28-->
      <edc:VirtualPin edc:name="AVDD"/>
    </edc:Pin>
